Revit 2027 API
BuiltInFailures.DPartFailures.DivideVolumesProfilesGapForWidthAll Property
 Division family cannot be used with the selected division gap for all widths of hosts
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DivideVolumesProfilesGapForWidthAll { get; }
Public Shared ReadOnly Property DivideVolumesProfilesGapForWidthAll As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DivideVolumesProfilesGapForWidthAll {
	FailureDefinitionId^ get ();
}
static member DivideVolumesProfilesGapForWidthAll : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DPartFailures Class
Autodesk.Revit.DB Namespace